[
    [
        "Joshua is at one of the ends.\nThe boy wearing the Black shirt is somewhere to the left of the youngest boy.\nJoshua likes Horror movies.\nThe 14-year-old boy is at the third position.\nThe boy wearing the Red shirt is somewhere between the 13-year-old boy and the one who likes Action movies, in that order.\nDaniel likes Thriller movies.\nThe boy who is going to eat Cookies is at one of the ends.\nThe boy wearing the Black shirt is exactly to the left of the one who likes Thriller movies.\nThe boy who is going to eat Crackers is exactly to the right of the boy who likes Comedy movies.\nThe boy wearing the Red shirt is somewhere between the boy who is going to eat Popcorn and Nicholas, in that order.\nAt one of the ends is the boy who likes Thriller movies.\nNicholas is somewhere between Joshua and Daniel, in that order.\nAt the first position is the boy wearing the Green shirt.",
        {
            "entities": [
                [
                    0,
                    6,
                    "PERSON"
                ],
                [
                    13,
                    16,
                    "CARDINAL"
                ],
                [
                    50,
                    55,
                    "COLOR"
                ],
                [
                    108,
                    114,
                    "PERSON"
                ],
                [
                    121,
                    127,
                    "CATEGORY"
                ],
                [
                    140,
                    151,
                    "DATE"
                ],
                [
                    166,
                    171,
                    "ORDINAL"
                ],
                [
                    202,
                    205,
                    "COLOR"
                ],
                [
                    237,
                    248,
                    "DATE"
                ],
                [
                    275,
                    281,
                    "CATEGORY"
                ],
                [
                    305,
                    311,
                    "PERSON"
                ],
                [
                    318,
                    326,
                    "CATEGORY"
                ],
                [
                    363,
                    370,
                    "PRODUCT"
                ],
                [
                    377,
                    380,
                    "CARDINAL"
                ],
                [
                    414,
                    419,
                    "COLOR"
                ],
                [
                    470,
                    478,
                    "CATEGORY"
                ],
                [
                    515,
                    523,
                    "PRODUCT"
                ],
                [
                    569,
                    575,
                    "CATEGORY"
                ],
                [
                    604,
                    607,
                    "COLOR"
                ],
                [
                    663,
                    670,
                    "PRODUCT"
                ],
                [
                    675,
                    683,
                    "PERSON"
                ],
                [
                    703,
                    706,
                    "CARDINAL"
                ],
                [
                    740,
                    748,
                    "CATEGORY"
                ],
                [
                    757,
                    765,
                    "PERSON"
                ],
                [
                    787,
                    793,
                    "PERSON"
                ],
                [
                    798,
                    804,
                    "PERSON"
                ],
                [
                    828,
                    833,
                    "ORDINAL"
                ],
                [
                    866,
                    871,
                    "COLOR"
                ]
            ]
        }
    ],
    [
        "The biggest hotel is somewhere between the Palace Hotel and the hotel that has 150 rooms, in that order.\nIn the second position is the hotel founded in the 30s.\nThe White hotel is somewhere to the left of the smallest hotel.\nIn the middle is the hotel owned by the German.\nThe hotel owned by the American is somewhere between the hotel that has 250 rooms and the White hotel, in that order.\nRoger manages the Red hotel.\nThe Seashore Hotel has 300 rooms.\nThe Vortex Hotel is somewhere to the right of the Green hotel.\nThe Italian built his hotel in the 50s.\nThe hotel that has 250 rooms is exactly to the left of the hotel managed by Roger.\nAt the first position is the hotel whose the owner was born in Paris.\nThe Green hotel is somewhere to the left of the hotel that has 200 rooms.\nIan works at the first hotel.\nThe Royal Hotel is somewhere between the hotel owned by the French and the Mirage Hotel, in that order.\nThe Italian owns the fourth hotel.\nThe Royal Hotel is White.\nCalvin manages the fourth hotel.\nThe Green hotel is somewhere to the left of the hotel founded right after World War II ended.\nThe White hotel is next to the hotel founded in the 30s.\nThe hotel managed by Calvin is somewhere between the Blue hotel and the hotel managed by Derrick, in that order.\nAt the third position is the hotel founded when The Great Depression started.",
        {
            "entities": [
                [
                    39,
                    55,
                    "FAC"
                ],
                [
                    79,
                    82,
                    "CARDINAL"
                ],
                [
                    112,
                    118,
                    "ORDINAL"
                ],
                [
                    156,
                    159,
                    "DATE"
                ],
                [
                    165,
                    170,
                    "COLOR"
                ],
                [
                    265,
                    271,
                    "NORP"
                ],
                [
                    296,
                    304,
                    "NORP"
                ],
                [
                    345,
                    348,
                    "CARDINAL"
                ],
                [
                    363,
                    368,
                    "COLOR"
                ],
                [
                    391,
                    396,
                    "PERSON"
                ],
                [
                    409,
                    412,
                    "COLOR"
                ],
                [
                    420,
                    438,
                    "ORG"
                ],
                [
                    443,
                    446,
                    "CARDINAL"
                ],
                [
                    454,
                    470,
                    "ORG"
                ],
                [
                    504,
                    509,
                    "COLOR"
                ],
                [
                    521,
                    528,
                    "NORP"
                ],
                [
                    552,
                    555,
                    "DATE"
                ],
                [
                    576,
                    579,
                    "CARDINAL"
                ],
                [
                    633,
                    638,
                    "PERSON"
                ],
                [
                    647,
                    652,
                    "ORDINAL"
                ],
                [
                    703,
                    708,
                    "GPE"
                ],
                [
                    714,
                    719,
                    "COLOR"
                ],
                [
                    773,
                    776,
                    "CARDINAL"
                ],
                [
                    784,
                    787,
                    "PERSON"
                ],
                [
                    801,
                    806,
                    "ORDINAL"
                ],
                [
                    814,
                    829,
                    "ORG"
                ],
                [
                    874,
                    880,
                    "NORP"
                ],
                [
                    885,
                    901,
                    "ORG"
                ],
                [
                    922,
                    929,
                    "NORP"
                ],
                [
                    939,
                    945,
                    "ORDINAL"
                ],
                [
                    953,
                    968,
                    "ORG"
                ],
                [
                    972,
                    977,
                    "COLOR"
                ],
                [
                    979,
                    985,
                    "PERSON"
                ],
                [
                    998,
                    1004,
                    "ORDINAL"
                ],
                [
                    1016,
                    1021,
                    "COLOR"
                ],
                [
                    1086,
                    1098,
                    "EVENT"
                ],
                [
                    1110,
                    1115,
                    "COLOR"
                ],
                [
                    1158,
                    1161,
                    "DATE"
                ],
                [
                    1184,
                    1190,
                    "PERSON"
                ],
                [
                    1216,
                    1220,
                    "COLOR"
                ],
                [
                    1252,
                    1259,
                    "PERSON"
                ],
                [
                    1283,
                    1288,
                    "ORDINAL"
                ],
                [
                    1324,
                    1344,
                    "EVENT"
                ]
            ]
        }
    ],
    [
        "Jo likes the Wispa Bites.\nThe person with the Hamster likes Swimming.\nHannah eats Dairy Milk.\nJessica is on the left of Georgina.\nLucy is the first on the left.\nThe first person on the right likes Swimming.\nThe person who eats Milky Bars owns a Horse.\nThe person in the middle eats Dairy Milk.\nJessica likes Green.\nThe person on the left of the middle wants to go to Tobago.\nThe person who wants to go to the Maldives likes Lilac.\nThe person who likes Wispa Bites sits next to the person who wants to go to Florida.\nThe person who likes Pink wants to go to Florida.\nThe person who sits first on the left likes Lilac.\nThe girl that likes Blue owns a Puppy.\nThe person who likes Skiing sits next to the person who has a Hamster.\nThe girl on the right of the girl who likes Tennis likes Horse riding.\nThe girl next to the girl who likes Milky Bars likes Boost.\nThe girl who likes Purple wants to go to Canada.\nThe girl who likes Crunchies owns a Rabbit.\nThe girl who likes Skiing sits next to the girl who plays Ten-pin bowlings.\nJessica wants to go to Australia.",
        {
            "entities": [
                [
                    0,
                    2,
                    "PERSON"
                ],
                [
                    13,
                    24,
                    "WORK_OF_ART"
                ],
                [
                    46,
                    53,
                    "ANIMAL"
                ],
                [
                    60,
                    68,
                    "ACTIVITY"
                ],
                [
                    70,
                    76,
                    "PERSON"
                ],
                [
                    82,
                    92,
                    "WORK_OF_ART"
                ],
                [
                    94,
                    101,
                    "PERSON"
                ],
                [
                    120,
                    128,
                    "PERSON"
                ],
                [
                    130,
                    134,
                    "PERSON"
                ],
                [
                    142,
                    147,
                    "ORDINAL"
                ],
                [
                    165,
                    170,
                    "ORDINAL"
                ],
                [
                    197,
                    205,
                    "ACTIVITY"
                ],
                [
                    227,
                    237,
                    "WORK_OF_ART"
                ],
                [
                    245,
                    250,
                    "ANIMAL"
                ],
                [
                    282,
                    292,
                    "WORK_OF_ART"
                ],
                [
                    294,
                    301,
                    "PERSON"
                ],
                [
                    308,
                    313,
                    "COLOR"
                ],
                [
                    367,
                    373,
                    "GPE"
                ],
                [
                    409,
                    417,
                    "GPE"
                ],
                [
                    424,
                    429,
                    "COLOR"
                ],
                [
                    452,
                    463,
                    "WORK_OF_ART"
                ],
                [
                    507,
                    514,
                    "GPE"
                ],
                [
                    537,
                    541,
                    "COLOR"
                ],
                [
                    557,
                    564,
                    "GPE"
                ],
                [
                    586,
                    591,
                    "ORDINAL"
                ],
                [
                    610,
                    615,
                    "COLOR"
                ],
                [
                    637,
                    641,
                    "COLOR"
                ],
                [
                    649,
                    654,
                    "ANIMAL"
                ],
                [
                    677,
                    683,
                    "ACTIVITY"
                ],
                [
                    718,
                    725,
                    "ANIMAL"
                ],
                [
                    771,
                    777,
                    "ACTIVITY"
                ],
                [
                    784,
                    796,
                    "ACTIVITY"
                ],
                [
                    834,
                    844,
                    "WORK_OF_ART"
                ],
                [
                    851,
                    856,
                    "WORK_OF_ART"
                ],
                [
                    877,
                    883,
                    "COLOR"
                ],
                [
                    899,
                    905,
                    "GPE"
                ],
                [
                    926,
                    935,
                    "WORK_OF_ART"
                ],
                [
                    943,
                    949,
                    "ANIMAL"
                ],
                [
                    970,
                    976,
                    "ACTIVITY"
                ],
                [
                    1009,
                    1025,
                    "ACTIVITY"
                ],
                [
                    1027,
                    1034,
                    "PERSON"
                ],
                [
                    1050,
                    1059,
                    "GPE"
                ]
            ]
        }
    ],
    [
        "At the fourth position is the girl drinking Strawberry juice.\nThe girl drinking Strawberry juice is somewhere between the girl who likes Art and the girl that is drinking Apple juice, in that order.\nRiley is next to the girl who likes the Roman civilization.\nThe girl wearing the Green shirt is drinking Apple juice.\nAt the fourth position is the girl that is interested in Religion.\nThe 12 years old girl is exactly to the right of the 11 years old girl.\nAt one of the ends is the girl who likes the Egyptian civilization.\nThe girl wearing the Black shirt is somewhere between the girl that likes Science and the girl wearing the Red shirt, in that order.\nThe girl wearing the Red shirt is somewhere to the left of the girl wearing the White shirt.\nThe girl drinking Cranberry juice likes the Greek civilization.\nElla is at the third position.\nThe 12 years old girl is next to the girl that is interested in Architecture.\nRiley is exactly to the right of the girl that admires the Roman civilization.\nThe girl drinking Cranberry juice is somewhere between the 13 years old girl and the girl drinking Grapefruit juice, in that order.\nAt one of the ends is the girl that likes Science.\nAt one of the ends is the girl who loves Architecture.\nLily is exactly to the right of the girl who likes Economy.\nMakayla is 10.\nThe girl interested in the Aztec civilization is somewhere between the girl interested in the Roman civilization and the girl interested in the Chinese civilization, in that order.\nThe youngest girl is at one of the ends.\nAt the second position is the girl that likes Art.",
        {
            "entities": [
                [
                    7,
                    13,
                    "ORDINAL"
                ],
                [
                    44,
                    54,
                    "FRUIT"
                ],
                [
                    80,
                    90,
                    "FRUIT"
                ],
                [
                    137,
                    140,
                    "DOMAIN"
                ],
                [
                    171,
                    176,
                    "ORG"
                ],
                [
                    199,
                    204,
                    "PERSON"
                ],
                [
                    239,
                    244,
                    "NORP"
                ],
                [
                    280,
                    285,
                    "COLOR"
                ],
                [
                    304,
                    309,
                    "FRUIT"
                ],
                [
                    324,
                    330,
                    "ORDINAL"
                ],
                [
                    374,
                    382,
                    "DOMAIN"
                ],
                [
                    384,
                    400,
                    "DATE"
                ],
                [
                    433,
                    449,
                    "DATE"
                ],
                [
                    459,
                    462,
                    "CARDINAL"
                ],
                [
                    501,
                    509,
                    "NORP"
                ],
                [
                    545,
                    550,
                    "COLOR"
                ],
                [
                    598,
                    605,
                    "DOMAIN"
                ],
                [
                    631,
                    634,
                    "COLOR"
                ],
                [
                    678,
                    681,
                    "COLOR"
                ],
                [
                    737,
                    742,
                    "COLOR"
                ],
                [
                    768,
                    777,
                    "FRUIT"
                ],
                [
                    794,
                    799,
                    "NORP"
                ],
                [
                    814,
                    818,
                    "PERSON"
                ],
                [
                    829,
                    834,
                    "ORDINAL"
                ],
                [
                    845,
                    861,
                    "DATE"
                ],
                [
                    909,
                    921,
                    "DOMAIN"
                ],
                [
                    923,
                    928,
                    "PERSON"
                ],
                [
                    982,
                    987,
                    "NORP"
                ],
                [
                    1020,
                    1029,
                    "FRUIT"
                ],
                [
                    1049,
                    1073,
                    "DATE"
                ],
                [
                    1101,
                    1111,
                    "FRUIT"
                ],
                [
                    1137,
                    1140,
                    "CARDINAL"
                ],
                [
                    1176,
                    1183,
                    "DOMAIN"
                ],
                [
                    1188,
                    1191,
                    "CARDINAL"
                ],
                [
                    1226,
                    1238,
                    "DOMAIN"
                ],
                [
                    1240,
                    1244,
                    "PERSON"
                ],
                [
                    1291,
                    1298,
                    "DOMAIN"
                ],
                [
                    1300,
                    1307,
                    "PERSON"
                ],
                [
                    1311,
                    1313,
                    "CARDINAL"
                ],
                [
                    1342,
                    1347,
                    "NORP"
                ],
                [
                    1409,
                    1414,
                    "NORP"
                ],
                [
                    1459,
                    1466,
                    "NORP"
                ],
                [
                    1520,
                    1523,
                    "CARDINAL"
                ],
                [
                    1544,
                    1550,
                    "ORDINAL"
                ],
                [
                    1583,
                    1586,
                    "DOMAIN"
                ]
            ]
        }
    ],
    [
        "The investor who lives in San Francisco is somewhere between the investor who invested $5 million last month and the investor who lives in Los Angeles, in that order.\nAt the fourth position is the investor interested in Healthcare companies.\nThe investor who invested $3 million last month is somewhere between the investor wearing the Red tie and the investor who invested $2 million last month, in that order.\nAt the fifth position is the investor interested in Internet companies.\nThe investor wearing the Red tie is somewhere to the left of the investor interested in Healthcare companies.\nThe investor that lives in Miami is next to the investor interested in Clean tech companies.\nThe investor wearing the Red tie is somewhere between the investor who invested $5 million last month and the investor wearing the Black tie, in that order.\nAt one of the ends is the investor who did a $4 million investment last month.\nMatt is next to the 45-year-old man.\nPierre is somewhere to the right of the investor wearing the Blue tie.\nThe 40-year-old man is next to the investor interested in Healthcare companies.\nThe man wearing the Red tie is somewhere between the man wearing the Green tie and the youngest man, in that order.\nThe investor wearing the Red tie is next to the investor who lives in Atlanta.\nDave is exactly to the left of the 30-year-old man.\nThe investor interested in Biotech companies is next to the investor who lives in Atlanta.\nThe 35-year-old man is somewhere between Adam and the investor interested in Software companies, in that order.\nThe 45-year-old investor is exactly to the right of the investor that invested $2 million last month.\nThe investor wearing the blue tie is interested in Software companies.\nThe 40-year-old man is next to the man wearing the Purple tie.\nAt the first position is the investor who lives in New York.",
        {
            "entities": [
                [
                    26,
                    39,
                    "GPE"
                ],
                [
                    87,
                    97,
                    "MONEY"
                ],
                [
                    98,
                    108,
                    "DATE"
                ],
                [
                    139,
                    150,
                    "GPE"
                ],
                [
                    174,
                    180,
                    "ORDINAL"
                ],
                [
                    220,
                    230,
                    "DOMAIN"
                ],
                [
                    268,
                    278,
                    "MONEY"
                ],
                [
                    279,
                    289,
                    "DATE"
                ],
                [
                    336,
                    339,
                    "COLOR"
                ],
                [
                    374,
                    384,
                    "MONEY"
                ],
                [
                    385,
                    395,
                    "DATE"
                ],
                [
                    419,
                    424,
                    "ORDINAL"
                ],
                [
                    464,
                    472,
                    "DOMAIN"
                ],
                [
                    509,
                    512,
                    "COLOR"
                ],
                [
                    572,
                    582,
                    "DOMAIN"
                ],
                [
                    621,
                    626,
                    "GPE"
                ],
                [
                    665,
                    675,
                    "DOMAIN"
                ],
                [
                    712,
                    715,
                    "COLOR"
                ],
                [
                    767,
                    777,
                    "MONEY"
                ],
                [
                    778,
                    788,
                    "DATE"
                ],
                [
                    818,
                    823,
                    "COLOR"
                ],
                [
                    847,
                    850,
                    "CARDINAL"
                ],
                [
                    889,
                    899,
                    "MONEY"
                ],
                [
                    911,
                    921,
                    "DATE"
                ],
                [
                    923,
                    927,
                    "PERSON"
                ],
                [
                    943,
                    954,
                    "DATE"
                ],
                [
                    960,
                    966,
                    "PERSON"
                ],
                [
                    1021,
                    1025,
                    "COLOR"
                ],
                [
                    1035,
                    1046,
                    "DATE"
                ],
                [
                    1089,
                    1099,
                    "DOMAIN"
                ],
                [
                    1131,
                    1134,
                    "COLOR"
                ],
                [
                    1180,
                    1185,
                    "COLOR"
                ],
                [
                    1252,
                    1255,
                    "COLOR"
                ],
                [
                    1297,
                    1304,
                    "GPE"
                ],
                [
                    1306,
                    1310,
                    "PERSON"
                ],
                [
                    1341,
                    1352,
                    "DATE"
                ],
                [
                    1385,
                    1392,
                    "DOMAIN"
                ],
                [
                    1440,
                    1447,
                    "GPE"
                ],
                [
                    1453,
                    1464,
                    "DATE"
                ],
                [
                    1490,
                    1494,
                    "PERSON"
                ],
                [
                    1526,
                    1534,
                    "DOMAIN"
                ],
                [
                    1565,
                    1576,
                    "DATE"
                ],
                [
                    1640,
                    1650,
                    "MONEY"
                ],
                [
                    1651,
                    1661,
                    "DATE"
                ],
                [
                    1688,
                    1692,
                    "COLOR"
                ],
                [
                    1714,
                    1722,
                    "DOMAIN"
                ],
                [
                    1738,
                    1749,
                    "DATE"
                ],
                [
                    1785,
                    1791,
                    "COLOR"
                ],
                [
                    1804,
                    1809,
                    "ORDINAL"
                ],
                [
                    1848,
                    1856,
                    "GPE"
                ]
            ]
        }
    ],
    [
        "Dane is at the fourth chair.\nThe customer talking about Economy is exactly to the left of the customer talking about Cars.\nThe Musician is next to the man using the Black cape.\nRandy is next to Dane.\nThe oldest man is exactly to the right of the man talking about Economy.\nThe Salesman is either at the first or at the last chair.\nThe customer who wants the Chinstrap beard is exactly to the left of Dane.\nThe man using the Blue cape is somewhere between the man talking about Economy and Dane, in that order.\nThe Accountant is at one of the ends.\nAt the fifth chair is the customer talking about Religion.\nThe man using the Red cape is talking about Religion.\nThe Teacher is exactly to the right of the Salesman.\nSimon is next to the man using the Blue cape.\nThe Teacher is exactly to the right of the 35-year-old customer.\nThe customer that wants the Van dyke beard is exactly to the left of the 45-year-old man.\nMartin is somewhere between the man that wants the Van dyke beard and the man talking about Politics, in that order.\nThe youngest costumer is next to the man talking about Sports.\nSimon is at one of the ends.\nThe man using the White cape is next to the Accountant.\nAt the fifth chair is the customer that wants the Anchor beard.\nThe man who wants the Mutton chops is somewhere between the man that wants the Chinstrap and the man that will get the Anchor beard, in that order.",
        {
            "entities": [
                [
                    0,
                    4,
                    "NORP"
                ],
                [
                    15,
                    21,
                    "ORDINAL"
                ],
                [
                    56,
                    63,
                    "DOMAIN"
                ],
                [
                    117,
                    121,
                    "DOMAIN"
                ],
                [
                    127,
                    135,
                    "ACTIVITY"
                ],
                [
                    165,
                    170,
                    "COLOR"
                ],
                [
                    177,
                    182,
                    "PERSON"
                ],
                [
                    194,
                    198,
                    "NORP"
                ],
                [
                    264,
                    271,
                    "DOMAIN"
                ],
                [
                    277,
                    285,
                    "ACTIVITY"
                ],
                [
                    303,
                    308,
                    "ORDINAL"
                ],
                [
                    358,
                    367,
                    "WORK_OF_ART"
                ],
                [
                    400,
                    404,
                    "PERSON"
                ],
                [
                    424,
                    428,
                    "COLOR"
                ],
                [
                    477,
                    484,
                    "DOMAIN"
                ],
                [
                    489,
                    493,
                    "NORP"
                ],
                [
                    514,
                    524,
                    "ACTIVITY"
                ],
                [
                    531,
                    534,
                    "CARDINAL"
                ],
                [
                    555,
                    560,
                    "ORDINAL"
                ],
                [
                    597,
                    605,
                    "DOMAIN"
                ],
                [
                    625,
                    628,
                    "COLOR"
                ],
                [
                    651,
                    659,
                    "DOMAIN"
                ],
                [
                    665,
                    672,
                    "ACTIVITY"
                ],
                [
                    704,
                    712,
                    "ACTIVITY"
                ],
                [
                    714,
                    719,
                    "PERSON"
                ],
                [
                    749,
                    753,
                    "COLOR"
                ],
                [
                    764,
                    771,
                    "ACTIVITY"
                ],
                [
                    803,
                    814,
                    "DATE"
                ],
                [
                    853,
                    861,
                    "WORK_OF_ART"
                ],
                [
                    898,
                    909,
                    "DATE"
                ],
                [
                    915,
                    921,
                    "PERSON"
                ],
                [
                    966,
                    974,
                    "WORK_OF_ART"
                ],
                [
                    1007,
                    1015,
                    "DOMAIN"
                ],
                [
                    1087,
                    1093,
                    "DOMAIN"
                ],
                [
                    1095,
                    1100,
                    "PERSON"
                ],
                [
                    1142,
                    1147,
                    "COLOR"
                ],
                [
                    1168,
                    1178,
                    "ACTIVITY"
                ],
                [
                    1187,
                    1192,
                    "ORDINAL"
                ],
                [
                    1230,
                    1236,
                    "WORK_OF_ART"
                ],
                [
                    1266,
                    1278,
                    "WORK_OF_ART"
                ],
                [
                    1323,
                    1332,
                    "WORK_OF_ART"
                ],
                [
                    1363,
                    1369,
                    "WORK_OF_ART"
                ]
            ]
        }
    ],
    [
        "The woman drinking Grape juice is next to the woman using the Green towel.\nThe Chef is somewhere between the Pilot and the woman drinking Orange juice, in that order.\nThe Translator is next to the woman eating the Bacon sandwich.\nThe 30-year-old woman is exactly to the left of the woman drinking Grape juice.\nMichaela is next to the woman using the Yellow towel.\nThe 40-year-old woman is exactly to the right of the 35-year-old woman.\nThe Chef is exactly to the right of the woman drinking Apple juice.\nThe woman using the Yellow towel is somewhere between the 30-year-old woman and the woman eating the Pork sandwich, in that order.\nMichaela is drinking Mango juice.\nAt one of the ends is the 40-year-old woman.\nThe Engineer is exactly to the left of the 35-year-old woman.\nEliana is next to the Translator.\nThe woman eating the Ham sandwich is somewhere between Yasmin and the woman eating the Bacon sandwich, in that order.\nThe woman using the Red towel is eating the Cheese sandwich.\nAt the first position is the woman using the White towel.\nThe woman using the Yellow towel is somewhere between the 30-year-old woman and the woman using the Green towel, in that order.\nEliana is exactly to the right of the woman drinking Orange juice.\nThe woman using the Yellow towel is somewhere to the left of Lydia.\nThe oldest woman is an Engineer.\nAt one of the ends is the woman eating the Pork sandwich.\nMichaela works as an Engineer.",
        {
            "entities": [
                [
                    19,
                    24,
                    "FRUIT"
                ],
                [
                    62,
                    67,
                    "COLOR"
                ],
                [
                    79,
                    83,
                    "ACTIVITY"
                ],
                [
                    109,
                    114,
                    "ACTIVITY"
                ],
                [
                    138,
                    144,
                    "FRUIT"
                ],
                [
                    171,
                    181,
                    "ACTIVITY"
                ],
                [
                    214,
                    219,
                    "PRODUCT"
                ],
                [
                    234,
                    245,
                    "DATE"
                ],
                [
                    297,
                    302,
                    "FRUIT"
                ],
                [
                    310,
                    318,
                    "PERSON"
                ],
                [
                    350,
                    356,
                    "COLOR"
                ],
                [
                    368,
                    379,
                    "DATE"
                ],
                [
                    417,
                    428,
                    "DATE"
                ],
                [
                    440,
                    444,
                    "ACTIVITY"
                ],
                [
                    491,
                    496,
                    "FRUIT"
                ],
                [
                    524,
                    530,
                    "COLOR"
                ],
                [
                    562,
                    573,
                    "DATE"
                ],
                [
                    605,
                    609,
                    "PRODUCT"
                ],
                [
                    635,
                    643,
                    "PERSON"
                ],
                [
                    656,
                    661,
                    "FRUIT"
                ],
                [
                    672,
                    675,
                    "CARDINAL"
                ],
                [
                    695,
                    706,
                    "DATE"
                ],
                [
                    718,
                    726,
                    "ACTIVITY"
                ],
                [
                    757,
                    768,
                    "DATE"
                ],
                [
                    776,
                    782,
                    "PERSON"
                ],
                [
                    798,
                    808,
                    "ACTIVITY"
                ],
                [
                    831,
                    834,
                    "PRODUCT"
                ],
                [
                    865,
                    871,
                    "PERSON"
                ],
                [
                    897,
                    902,
                    "PRODUCT"
                ],
                [
                    948,
                    951,
                    "COLOR"
                ],
                [
                    972,
                    978,
                    "PRODUCT"
                ],
                [
                    996,
                    1001,
                    "ORDINAL"
                ],
                [
                    1034,
                    1039,
                    "COLOR"
                ],
                [
                    1067,
                    1073,
                    "COLOR"
                ],
                [
                    1105,
                    1116,
                    "DATE"
                ],
                [
                    1147,
                    1152,
                    "COLOR"
                ],
                [
                    1175,
                    1181,
                    "PERSON"
                ],
                [
                    1228,
                    1234,
                    "FRUIT"
                ],
                [
                    1262,
                    1268,
                    "COLOR"
                ],
                [
                    1303,
                    1308,
                    "PERSON"
                ],
                [
                    1333,
                    1341,
                    "ACTIVITY"
                ],
                [
                    1346,
                    1349,
                    "CARDINAL"
                ],
                [
                    1386,
                    1390,
                    "PRODUCT"
                ],
                [
                    1401,
                    1409,
                    "PERSON"
                ],
                [
                    1422,
                    1430,
                    "ACTIVITY"
                ]
            ]
        }
    ],
    [
        "In the middle is the boy that likes Baseball.\nThe cyclist who is going to eat Tuna sandwich is at one of the ends.\nThe owner of the White bike is somewhere between the 15-year-old boy and the youngest boy, in that order.\nThe boy that is going to drink Pineapple juice is at the fourth position.\nHenry is exactly to the left of the Soccer fan.\nThe boy who is going to drink Grapefruit juice is somewhere between who brought Tuna sandwich and who brought Pineapple juice, in that order.\nThe boy riding the Black bike is at the third position.\nThe one who likes Swimming is next to the friend who likes Baseball.\nThe cyclist that brought Pineapple juice is somewhere between the 14-year-old and the boy that brought Orange juice, in that order.\nAt one of the ends is the boy riding the Green bicycle.\nThe boy who likes the sport played on ice is going to eat Pepperoni sandwich.\nThe boy riding the White bike is somewhere between the boys riding the blue and the black bicycles, in that order.\nJoel is next to the 16-year-old cyclist.\nAdrian is exactly to the left of the boy who is going to eat Pepperoni sandwich.\nThe 12-year-old is somewhere between the 14-year-old and the oldest boy, in that order.\nThe boy who is going to eat Bacon sandwich is somewhere to the right of the owner of the White bicycle.\nThe 16-year-old brought Cheese sandwich.\nIn the fifth position is the 13-year-old boy.\nThe cyclist riding the White bike is somewhere between Richard and the boy riding the Red bike, in that order.\nThe Baseball fan is next to the boy who is going to drink Apple juice.\nThe boy who likes Hockey is at the fifth position.\nCharles is somewhere between Richard and Adrian, in that order.",
        {
            "entities": [
                [
                    36,
                    44,
                    "ACTIVITY"
                ],
                [
                    78,
                    82,
                    "PRODUCT"
                ],
                [
                    98,
                    101,
                    "CARDINAL"
                ],
                [
                    132,
                    137,
                    "COLOR"
                ],
                [
                    168,
                    179,
                    "DATE"
                ],
                [
                    252,
                    261,
                    "FRUIT"
                ],
                [
                    278,
                    284,
                    "ORDINAL"
                ],
                [
                    295,
                    300,
                    "PERSON"
                ],
                [
                    331,
                    337,
                    "ACTIVITY"
                ],
                [
                    373,
                    383,
                    "FRUIT"
                ],
                [
                    423,
                    427,
                    "PRODUCT"
                ],
                [
                    453,
                    462,
                    "FRUIT"
                ],
                [
                    504,
                    509,
                    "COLOR"
                ],
                [
                    525,
                    530,
                    "ORDINAL"
                ],
                [
                    559,
                    567,
                    "ACTIVITY"
                ],
                [
                    600,
                    608,
                    "ACTIVITY"
                ],
                [
                    635,
                    644,
                    "FRUIT"
                ],
                [
                    676,
                    687,
                    "DATE"
                ],
                [
                    713,
                    719,
                    "COLOR"
                ],
                [
                    745,
                    748,
                    "CARDINAL"
                ],
                [
                    783,
                    788,
                    "COLOR"
                ],
                [
                    856,
                    865,
                    "PRODUCT"
                ],
                [
                    895,
                    900,
                    "COLOR"
                ],
                [
                    947,
                    951,
                    "COLOR"
                ],
                [
                    960,
                    965,
                    "COLOR"
                ],
                [
                    991,
                    995,
                    "PERSON"
                ],
                [
                    1011,
                    1022,
                    "DATE"
                ],
                [
                    1032,
                    1038,
                    "PERSON"
                ],
                [
                    1093,
                    1102,
                    "PRODUCT"
                ],
                [
                    1117,
                    1128,
                    "DATE"
                ],
                [
                    1154,
                    1165,
                    "DATE"
                ],
                [
                    1229,
                    1234,
                    "PRODUCT"
                ],
                [
                    1290,
                    1295,
                    "COLOR"
                ],
                [
                    1309,
                    1320,
                    "DATE"
                ],
                [
                    1329,
                    1335,
                    "PRODUCT"
                ],
                [
                    1353,
                    1358,
                    "ORDINAL"
                ],
                [
                    1375,
                    1386,
                    "DATE"
                ],
                [
                    1415,
                    1420,
                    "COLOR"
                ],
                [
                    1447,
                    1454,
                    "PERSON"
                ],
                [
                    1478,
                    1481,
                    "COLOR"
                ],
                [
                    1507,
                    1515,
                    "ACTIVITY"
                ],
                [
                    1561,
                    1566,
                    "FRUIT"
                ],
                [
                    1592,
                    1598,
                    "ACTIVITY"
                ],
                [
                    1609,
                    1614,
                    "ORDINAL"
                ],
                [
                    1625,
                    1632,
                    "PERSON"
                ],
                [
                    1654,
                    1661,
                    "PERSON"
                ],
                [
                    1666,
                    1672,
                    "PERSON"
                ]
            ]
        }
    ],
    [
        "The student who was born in August is exactly to the left of the student playing Word Search.\nThe girl using the Asus laptop is exactly to the left of the girl whose birthday is in June.\nKrystal has the Green laptop sleeve.\nIn the fifth position is the girl playing Zebra Puzzle.\nMonica's favorite subject is History.\nThe student playing Tangram is next to the student who has the Blue laptop sleeve.\nJoanna is exactly to the right of the girl that likes History.\nThe girl born in the Valentine's Day is somewhere to the right of the girl that has the Red laptop sleeve.\nKrystal is next to the student using a laptop from Apple.\nThe student who likes Math is exactly to the right of the girl who was born in August.\nThe one using the Apple laptop is exactly to the left of the girl playing Tangram.\nThe owner of the Blue laptop sleeve is somewhere to the left of the girl who was born in the sixth month.\nThe girl playing Jigsaw Puzzle is using a laptop from Asus.\nThe student that has the White laptop sleeve is somewhere between the student who likes Science and Elaine, in that order.\nIn the middle is the girl that was born in the month we celebrate Halloween.\nThe girl born in October likes History.\nThe student who has the Black laptop sleeve is using the laptop from Samsung.\nThe student that likes Art is somewhere to the right of the student who has the Blue laptop sleeve.\nThe owner of the White laptop sleeve is somewhere between the owners of the Green and Red laptop sleeves, in that order.\nThe girl born in April is exactly to the left of the girl using the laptop from Sony.\nElaine is next to the student playing Jigsaw Puzzle.",
        {
            "entities": [
                [
                    28,
                    34,
                    "DATE"
                ],
                [
                    81,
                    92,
                    "WORK_OF_ART"
                ],
                [
                    113,
                    117,
                    "ORG"
                ],
                [
                    181,
                    185,
                    "DATE"
                ],
                [
                    187,
                    194,
                    "PERSON"
                ],
                [
                    203,
                    208,
                    "COLOR"
                ],
                [
                    231,
                    236,
                    "ORDINAL"
                ],
                [
                    266,
                    278,
                    "WORK_OF_ART"
                ],
                [
                    280,
                    286,
                    "PERSON"
                ],
                [
                    309,
                    316,
                    "DOMAIN"
                ],
                [
                    338,
                    345,
                    "WORK_OF_ART"
                ],
                [
                    381,
                    385,
                    "COLOR"
                ],
                [
                    401,
                    407,
                    "PERSON"
                ],
                [
                    455,
                    462,
                    "DOMAIN"
                ],
                [
                    485,
                    500,
                    "DATE"
                ],
                [
                    552,
                    555,
                    "COLOR"
                ],
                [
                    571,
                    578,
                    "PERSON"
                ],
                [
                    622,
                    627,
                    "FRUIT"
                ],
                [
                    651,
                    655,
                    "DOMAIN"
                ],
                [
                    708,
                    714,
                    "DATE"
                ],
                [
                    720,
                    723,
                    "CARDINAL"
                ],
                [
                    734,
                    739,
                    "ORG"
                ],
                [
                    790,
                    797,
                    "WORK_OF_ART"
                ],
                [
                    816,
                    820,
                    "COLOR"
                ],
                [
                    888,
                    903,
                    "DATE"
                ],
                [
                    922,
                    935,
                    "WORK_OF_ART"
                ],
                [
                    959,
                    963,
                    "ORG"
                ],
                [
                    990,
                    995,
                    "COLOR"
                ],
                [
                    1053,
                    1060,
                    "DOMAIN"
                ],
                [
                    1065,
                    1071,
                    "PERSON"
                ],
                [
                    1131,
                    1140,
                    "DATE"
                ],
                [
                    1154,
                    1163,
                    "DATE"
                ],
                [
                    1182,
                    1189,
                    "DATE"
                ],
                [
                    1196,
                    1203,
                    "DOMAIN"
                ],
                [
                    1229,
                    1234,
                    "COLOR"
                ],
                [
                    1274,
                    1281,
                    "ORG"
                ],
                [
                    1306,
                    1309,
                    "DOMAIN"
                ],
                [
                    1363,
                    1367,
                    "COLOR"
                ],
                [
                    1400,
                    1405,
                    "COLOR"
                ],
                [
                    1459,
                    1464,
                    "COLOR"
                ],
                [
                    1469,
                    1472,
                    "COLOR"
                ],
                [
                    1521,
                    1526,
                    "DATE"
                ],
                [
                    1584,
                    1588,
                    "ORG"
                ],
                [
                    1590,
                    1596,
                    "PERSON"
                ],
                [
                    1628,
                    1641,
                    "WORK_OF_ART"
                ]
            ]
        }
    ],
    [
        "The car that has a Transmission problem is exactly to the left of the car that has a Radiator problem.\nAt the second position is the car that has a Radiator problem.\nThe German car is exactly to the right of the car with 50,000 miles.\nThe car with 20,000 miles is at one of the ends.\nThe Hatchback has the least mileage of all five cars.\nThe Korean car is exactly to the right of the car with 40,000 miles.\nThe White car is next to the Crossover.\nThe car with 60,000 miles has an Engine problem.\nThe SUV is somewhere between the car that is being fixed by Melvin and the Pickup, in that order.\nThe Green car is exactly to the right of the car that has a Transmission problem.\nAt one of the ends is the White car.\nThe Italian car is at the fourth position.\nAt one of the ends is the car that has a Suspension problem.\nMelvin is fixing the car that is exactly to the left of the French car.\nWillie is repairing the car that is at the fifth position.\nThe car that is being fixed by Kyle is exactly to the left of the Red car.\nThe Blue car is somewhere to the right of the Black car.\nThe car that is being repaired by Melvin is next to the car with 50,000 miles.\nThe car with 20,000 miles is exactly to the right of the car with 40,000 miles.\nThe car that has an Airbag problem is somewhere to the right of the Green car.\nKyle is repairing the car that is somewhere between the SUV and the car that is being fixed by Damon, in that order.",
        {
            "entities": [
                [
                    19,
                    31,
                    "PRODUCT"
                ],
                [
                    85,
                    93,
                    "PRODUCT"
                ],
                [
                    110,
                    116,
                    "ORDINAL"
                ],
                [
                    148,
                    156,
                    "PRODUCT"
                ],
                [
                    170,
                    176,
                    "NORP"
                ],
                [
                    221,
                    233,
                    "QUANTITY"
                ],
                [
                    248,
                    260,
                    "QUANTITY"
                ],
                [
                    267,
                    270,
                    "CARDINAL"
                ],
                [
                    288,
                    297,
                    "CATEGORY"
                ],
                [
                    327,
                    331,
                    "CARDINAL"
                ],
                [
                    342,
                    348,
                    "NORP"
                ],
                [
                    393,
                    405,
                    "QUANTITY"
                ],
                [
                    411,
                    416,
                    "COLOR"
                ],
                [
                    436,
                    445,
                    "CATEGORY"
                ],
                [
                    460,
                    472,
                    "QUANTITY"
                ],
                [
                    480,
                    486,
                    "PRODUCT"
                ],
                [
                    500,
                    503,
                    "CATEGORY"
                ],
                [
                    556,
                    562,
                    "PERSON"
                ],
                [
                    571,
                    577,
                    "CATEGORY"
                ],
                [
                    598,
                    603,
                    "COLOR"
                ],
                [
                    654,
                    666,
                    "PRODUCT"
                ],
                [
                    679,
                    682,
                    "CARDINAL"
                ],
                [
                    702,
                    707,
                    "COLOR"
                ],
                [
                    717,
                    724,
                    "NORP"
                ],
                [
                    739,
                    745,
                    "ORDINAL"
                ],
                [
                    759,
                    762,
                    "CARDINAL"
                ],
                [
                    797,
                    807,
                    "PRODUCT"
                ],
                [
                    817,
                    823,
                    "PERSON"
                ],
                [
                    877,
                    883,
                    "NORP"
                ],
                [
                    889,
                    895,
                    "PERSON"
                ],
                [
                    932,
                    937,
                    "ORDINAL"
                ],
                [
                    979,
                    983,
                    "PERSON"
                ],
                [
                    1014,
                    1017,
                    "COLOR"
                ],
                [
                    1027,
                    1031,
                    "COLOR"
                ],
                [
                    1069,
                    1074,
                    "COLOR"
                ],
                [
                    1114,
                    1120,
                    "PERSON"
                ],
                [
                    1145,
                    1157,
                    "QUANTITY"
                ],
                [
                    1172,
                    1184,
                    "QUANTITY"
                ],
                [
                    1225,
                    1237,
                    "QUANTITY"
                ],
                [
                    1259,
                    1265,
                    "PRODUCT"
                ],
                [
                    1307,
                    1312,
                    "COLOR"
                ],
                [
                    1318,
                    1322,
                    "PERSON"
                ],
                [
                    1374,
                    1377,
                    "CATEGORY"
                ],
                [
                    1413,
                    1418,
                    "PERSON"
                ]
            ]
        }
    ]
]